_posts/2018-10-08-Getting-derivatives-from-implicit-functions-with-autograd.html
---
title: Getting derivatives from implicit functions with autograd
date: 2018/10/08 19:53:21
updated: 2018/10/08 19:53:21
categories: python, autograd
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1e7bbe1">1. Example 1</a></li>
<li><a href="#org30374e2">2. Example 2</a></li>
<li><a href="#orgc49e13d">3. Example 3</a></li>
<li><a href="#org452c660">4. Example 4</a></li>
<li><a href="#org67383a5">5. Example 5</a></li>
<li><a href="#org0081ece">6. Example 6</a></li>
<li><a href="#orgedd1f4b">7. Example 7</a></li>
<li><a href="#orgb2b9394">8. Conclusions</a></li>
</ul>
</div>
</div>
<p>
If we have an implicit function: \(f(x, y(x)) = 0\), but we want to compute the derivative \(dy/dx\) we can use the chain rule to derive:
</p>

<p>
\(df/dx + df/dy dy/dx = 0\)
</p>

<p>
We can then solve for \(dy/dx\):
</p>

<p>
\(dy/dx = -df/dx / df/dy\) to get the desired derivative. The interesting point of this blog post is that we can get the two derivatives on the right hand side of this equation using automatic differentiation of the function \(f(x, y)\)! There are a few examples of analytical approaches to derivatives from implicit functions <a href="https://www.math.ucdavis.edu/~kouba/CalcOneDIRECTORY/implicitdiffdirectory/ImplicitDiff.html">here</a>, and I wanted to explore them with autograd in this post.
</p>

<p>
In the following examples, we will assume that \(y\) is a function of \(x\) and that \(x\) is independent. We will consider a series of implicit equations, compute \(dy/dx\) using autograd from the formula above, and compare them to the analytical results in the web page referenced above.
</p>

<p>
The \(dy/dx\) functions generally depend on both \(x\), and \(y\). Technically, these are the derivatives along the curve \(y(x)\), but since we can evaluate them at any points, we will use some random points for \(x\) and \(y\) to test for equality between the analytical derivatives and the autograd derivatives. This isn't a rigorous proof of equality, but it is the only thing that makes sense to do for now. It is assumed that if these points are ok, all the others are too. That might be a broad claim, since we only sample \(x\) and \(y\) from 0 to 1 here but the approach is general. Here are the imports and the random test points for all the examples that follow.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">import</span> autograd.numpy <span style="color: #0000FF;">as</span> np
<span style="color: #0000FF;">from</span> autograd <span style="color: #0000FF;">import</span> grad

<span style="color: #BA36A5;">xr</span> = np.random.random(50)
<span style="color: #BA36A5;">yr</span> = np.random.random(50)
</pre>
</div>


<div id="outline-container-org1e7bbe1" class="outline-2">
<h2 id="org1e7bbe1"><span class="section-number-2">1</span> Example 1</h2>
<div class="outline-text-2" id="text-1">
<p>
\(x^3 + y^3 = 4\)
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">def</span> <span style="color: #006699;">f1</span>(x, y):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> x**3 + y**3 - 4

<span style="color: #BA36A5;">D1x</span> = grad(f1, 0)
<span style="color: #BA36A5;">D1y</span> = grad(f1, 1)

<span style="color: #BA36A5;">dydx_1</span> = <span style="color: #0000FF;">lambda</span> x, y: -D1x(x, y) / D1y(x, y)
<span style="color: #BA36A5;">dydx_1a</span> = <span style="color: #0000FF;">lambda</span> x, y: -x**2 / y**2

np.allclose(dydx_1a(xr, yr),
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>[dydx_1(_xr, _yr) <span style="color: #0000FF;">for</span> _xr, _yr <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(xr, yr)])
</pre>
</div>

<pre class="example">
True

</pre>

<p>
The output of True means the autograd results and the analytical results are "all close", i.e. within a tolerance the results are the same. The required derivatives of this are not that difficult to derive, but it is nice to see a simple example that "just works". A subtle point of the dydx function is that it is not <i>vectorized</i> which is why I used a list comprehension to evaluate all the points. It might be possible to make a pseudo-vectorized version with the np.vectorize decorator, but that is not of interest here.
</p>
</div>
</div>

<div id="outline-container-org30374e2" class="outline-2">
<h2 id="org30374e2"><span class="section-number-2">2</span> Example 2</h2>
<div class="outline-text-2" id="text-2">
<p>
\((x - y)^2 = x + y - 1\)
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">def</span> <span style="color: #006699;">f2</span>(x, y):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> (x - y)**2 - x - y + 1

<span style="color: #BA36A5;">D2x</span> = grad(f2, 0)
<span style="color: #BA36A5;">D2y</span> = grad(f2, 1)

<span style="color: #BA36A5;">dydx_2</span> = <span style="color: #0000FF;">lambda</span> x, y: -D2x(x, y) / D2y(x, y)
<span style="color: #BA36A5;">dydx2_a</span> = <span style="color: #0000FF;">lambda</span> x, y: (2 * y - 2 * x + 1) / (2 * y - 2 * x - 1)

np.allclose(dydx2_a(xr, yr),
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   [dydx_2(_xr, _yr) <span style="color: #0000FF;">for</span> _xr, _yr <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(xr, yr)])
</pre>
</div>

<pre class="example">
True

</pre>

<p>
This also works.
</p>
</div>
</div>

<div id="outline-container-orgc49e13d" class="outline-2">
<h2 id="orgc49e13d"><span class="section-number-2">3</span> Example 3</h2>
<div class="outline-text-2" id="text-3">
<p>
\(y = sin(3x + 4y)\)
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">def</span> <span style="color: #006699;">f3</span>(x, y):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> y - np.sin(3 * x + 4 * y)


<span style="color: #BA36A5;">D3x</span> = grad(f3, 0)
<span style="color: #BA36A5;">D3y</span> = grad(f3, 1)

<span style="color: #BA36A5;">dydx_3</span> = <span style="color: #0000FF;">lambda</span> x, y: -D3x(x, y) / D3y(x, y)
<span style="color: #BA36A5;">dydx3_a</span> = <span style="color: #0000FF;">lambda</span> x, y: (3 * np.cos(3 * x + 4 * y)) / (1 - 4 * np.cos(3 * x + 4 * y))

np.allclose(dydx3_a(xr, yr),
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   [dydx_3(_xr, _yr) <span style="color: #0000FF;">for</span> _xr, _yr <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(xr, yr)])
</pre>
</div>

<pre class="example">
True

</pre>

<p>
Check.
</p>
</div>
</div>

<div id="outline-container-org452c660" class="outline-2">
<h2 id="org452c660"><span class="section-number-2">4</span> Example 4</h2>
<div class="outline-text-2" id="text-4">
<p>
\(y = x^2 y^3 + x^3 y^2\)
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">def</span> <span style="color: #006699;">f4</span>(x, y):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> y - x**2 * y**3 - x**3 * y**2


<span style="color: #BA36A5;">D4x</span> = grad(f4, 0)
<span style="color: #BA36A5;">D4y</span> = grad(f4, 1)

<span style="color: #BA36A5;">dydx_4</span> = <span style="color: #0000FF;">lambda</span> x, y: -D4x(x, y) / D4y(x, y)
<span style="color: #BA36A5;">dydx4_a</span> = <span style="color: #0000FF;">lambda</span> x, y: (2 * x * y**3 + 3 * x**2 * y**2) / (1 - 3 * x**2 * y**2 - 2 * x**3 * y)

np.allclose(dydx4_a(xr, yr),
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   [dydx_4(_xr, _yr) <span style="color: #0000FF;">for</span> _xr, _yr <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(xr, yr)])
</pre>
</div>

<pre class="example">
True

</pre>
</div>
</div>

<div id="outline-container-org67383a5" class="outline-2">
<h2 id="org67383a5"><span class="section-number-2">5</span> Example 5</h2>
<div class="outline-text-2" id="text-5">
<p>
\(e^{xy} = e^{4x} - e^{5y}\)
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">def</span> <span style="color: #006699;">f5</span>(x, y):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> np.exp(4 * x) - np.exp(5 * y) - np.exp(x * y)

<span style="color: #BA36A5;">D5x</span> = grad(f5, 0)
<span style="color: #BA36A5;">D5y</span> = grad(f5, 1)

<span style="color: #BA36A5;">dydx_5</span> = <span style="color: #0000FF;">lambda</span> x, y: -D5x(x, y) / D5y(x, y)
<span style="color: #BA36A5;">dydx5_a</span> = <span style="color: #0000FF;">lambda</span> x, y: (4 * np.exp(4 * x) - y * np.exp(x * y)) / (x * np.exp(x * y) + 5 * np.exp(5 * y))

np.allclose(dydx5_a(xr, yr),
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   [dydx_5(_xr, _yr) <span style="color: #0000FF;">for</span> _xr, _yr <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(xr, yr)])
</pre>
</div>

<pre class="example">
True

</pre>

<p>
Also check.
</p>
</div>
</div>

<div id="outline-container-org0081ece" class="outline-2">
<h2 id="org0081ece"><span class="section-number-2">6</span> Example 6</h2>
<div class="outline-text-2" id="text-6">
<p>
\(\cos^2 x + cos^2 y = cos(2x + 2y)\)
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">def</span> <span style="color: #006699;">f6</span>(x, y):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> np.cos(x)**2 + np.cos(y)**2 - np.cos(2 * x + 2 * y)

<span style="color: #BA36A5;">D6x</span> = grad(f6, 0)
<span style="color: #BA36A5;">D6y</span> = grad(f6, 1)

<span style="color: #BA36A5;">dydx_6</span> = <span style="color: #0000FF;">lambda</span> x, y: -D6x(x, y) / D6y(x, y)
<span style="color: #BA36A5;">dydx6_a</span> = <span style="color: #0000FF;">lambda</span> x, y: (np.cos(x) * np.sin(x) - np.sin(2 * x + 2 * y)) / (np.sin(2 * x + 2 * y) - np.cos(y) * np.sin(y))

np.allclose(dydx6_a(xr, yr),
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   [dydx_6(_xr, _yr) <span style="color: #0000FF;">for</span> _xr, _yr <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(xr, yr)])
</pre>
</div>

<pre class="example">
True

</pre>

<p>
Check.
</p>
</div>
</div>

<div id="outline-container-orgedd1f4b" class="outline-2">
<h2 id="orgedd1f4b"><span class="section-number-2">7</span> Example 7</h2>
<div class="outline-text-2" id="text-7">
<p>
\(x = 3 + \sqrt{x^2 + y^2}\)
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">def</span> <span style="color: #006699;">f7</span>(x, y):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> 3 + np.sqrt(x**2 + y**2) - x

<span style="color: #BA36A5;">D7x</span> = grad(f7, 0)
<span style="color: #BA36A5;">D7y</span> = grad(f7, 1)

<span style="color: #BA36A5;">dydx_7</span> = <span style="color: #0000FF;">lambda</span> x, y: -D7x(x, y) / D7y(x, y)
<span style="color: #BA36A5;">dydx7_a</span> = <span style="color: #0000FF;">lambda</span> x, y: (np.sqrt(x**2 + y**2) - x) / y

np.allclose(dydx7_a(xr, yr),
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   [dydx_7(_xr, _yr) <span style="color: #0000FF;">for</span> _xr, _yr <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(xr, yr)])
</pre>
</div>

<pre class="example">
True

</pre>
</div>
</div>


<div id="outline-container-orgb2b9394" class="outline-2">
<h2 id="orgb2b9394"><span class="section-number-2">8</span> Conclusions</h2>
<div class="outline-text-2" id="text-8">
<p>
There are a handful of other examples at the website referenced in the beginning, but I am stopping here. After seven examples of quantitative agreement between the easy to derive autograd derivatives, and the easy to moderately difficult analytical derivatives, it seems like it is autograd for the win here. This technique has some important implications for engineering calculations that I will explore in a future post. Until then, this is yet another interesting thing we can do with automatic differentiation!
</p>
</div>
</div>
<p>Copyright (C) 2018 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2018/10/08/Getting-derivatives-from-implicit-functions-with-autograd.org">org-mode source</a></p>
<p>Org-mode version = 9.1.13</p>